#+AUTHOR: Jeremy Barisch-Rooney
#+TITLE: Damage Detection of Concrete Slab Bridges
#+OPTIONS: toc:nil
#+LATEX_HEADER: \usepackage{commath}
#+LATEX_HEADER: \usemintedstyle{emacs}
#+LATEX_HEADER: \usepackage[margin=1in=]{geometry}
#+LATEX_HEADER: \usepackage{placeins}
#+LATEX_HEADER: \usepackage{siunitx}
#+LATEX_HEADER: \usepackage[square, numbers]{natbib}
#+LATEX_HEADER: \usepackage{xcolor}

# ./cli.sh --save --mesh full contour cover-photo --x 85 --deform 3.5
[[../../saved-generated-data-images/bridge-705-full-3d/healthy/cover-photo/cover-photo-cropped.pdf]]

#+LATEX: \newpage
#+LATEX: \section*{Acknowledgements}
I would like to thank...

\textcolor{red}{TODO: Acknowledgements}
#+LATEX: \newpage
#+LATEX: \tableofcontents
#+LATEX: \newpage
#+LATEX: \listoffigures
#+LATEX: \newpage
#+LATEX: \listoflistings
#+LATEX: \newpage
#+LATEX: \listoftables
#+LATEX: \newpage

# ./cli.sh --mesh med --save-to /z/saved-med simulate uls

# ./cli.sh --mesh med --save-to /z/saved-verify --shorten-paths true verify comp-responses

# ./cli.sh --mesh full --save-to /z/saved-diana-comp validate diana-comp

# Move folder up one level.
# ./cli.sh --mesh med --save-to /z/saved-sensors-med --shorten-paths true validate sensors

# ./cli.sh --mesh full --save-to /z/jeremy/per-sensors-full --shorten-paths true validate sensors

# ./cli.sh --mesh full --save-to /z/saved-piers --two-materials validate pier-disp

# ./cli.sh --shorten-paths false --save-to /Volumes/THESIS/pier-5-convergence
# validate pier-conv --pier 5 --max-nodes 100000 --without-radius 2 --nesw-loc 0
# --nesw-max-dist 5 --max-shell-len 2 --min-shell-len 0.35

# ./cli.sh --mesh low --save-to /z/throwaway --two-materials validate thermal

# ./cli.sh --mesh med --save-to /z/param-uls --shorten-paths true params param-uls

# On MBP.
# ./cli.sh params noise
# ./cli.sh classify temp-effect-4

** Diana FEM
<<sec:app:diana>>

# The mean difference of the maximum displacements between simulations is
# $0.0784 mm$ and the mean difference of the minimum displacements is $0.2165
# mm$.

# TODO: Update values and tables.

#+NAME: tbl:diana-nodes
#+CAPTION[Nodes chosen for loading in Diana]: Identifiers of nodes in the Diana bridge 705 model. Each node corresponds to a loading position in Table [[tbl:loading-positions]]. Providing this information allows for the contour plots from the Diana model to be reproduced, by anyone with a licence for the Diana software. The Diana model can either be requested from the thesis author, or can be found in the =traffic-sim= GitHub repository.
| Label | Node identifier |        X |        Z |
|-------+-----------------+----------+----------|
| A     | 126'679         | 34.95459 | 26.24579 |
| B     | 87'125          | 51.25051 |     16.6 |
| C     | 53'166          | 89.98269 | 9.445789 |
| D     | 54'603          | 102.5037 | 6.954211 |

#+NAME: tbl:max-displacement
#+CAPTION[Comparison of maximum displacement with Diana]: Comparison of maximum displacement between simulations of bridge 705 with the validated Diana model and a high-density OpenSees model. The first column determined the position of a 100kN point load applied in simulation, the position is defined in Table [[tbl:loading-positions]]. The second and third columns show the maximum displacement in millimeters for the Diana and OpenSees models respectively, due to the 100kN load placed at the labeled point.
| Point | Diana (mm) | OpenSees (mm) | Diff. (mm) | Diff. / Diana |
|-------+------------+---------------+------------+---------------|
| A     |     0.1015 |        0.1082 |     0.0067 |        0.0660 |
| B     |     0.0030 |        0.0032 |     0.0002 |        0.0667 |
| C     |     0.0116 |        0.0121 |     0.0005 |        0.0431 |
| D     |     0.0058 |        0.0066 |     0.0008 |        0.1379 |
|-------+------------+---------------+------------+---------------|
|       |            |          Mean |     0.0021 |        0.0784 |
#+TBLFM: $4=abs($2-$3);%0.4f::$5=abs($4/$2);%0.4f::@6$4=vmean(@2$4..@5$4);%0.4f::@6$5=vmean(@2$5..@5$5);%0.4f

#+NAME: tbl:min-displacement
#+CAPTION[Comparison of minimum displacement with Diana]: Comparison of minimum displacement between simulations of bridge 705 with the validated Diana model and a high-density OpenSees model. The first column determines the position of a 100kN point load applied in simulation, the position is defined in Table [[tbl:loading-positions]]. The second and third columns show the minimum displacement in millimeters for the Diana and OpenSees models respectively, due to the 100kN load placed at the labeled point.
| Point | Diana (mm) | OpenSees (mm) | Diff. (mm) | Diff. / Diana |
|-------+------------+---------------+------------+---------------|
| A     |    -0.2810 |       -0.3221 |     0.0411 |        0.1463 |
| B     |    -0.1375 |       -0.1431 |     0.0056 |        0.0407 |
| C     |    -0.0464 |       -0.0673 |     0.0209 |        0.4504 |
| D     |    -0.0210 |       -0.0258 |     0.0048 |        0.2286 |
|-------+------------+---------------+------------+---------------|
|       |            |          Mean |     0.0181 |        0.2165 |
#+TBLFM: $4=abs($2-$3);%0.4f::$5=abs($4/$2);%0.4f::@6$4=vmean(@2$4..@5$4);%0.4f::@6$5=vmean(@2$5..@5$5);%0.4f

#+NAME: fig:comp-diana-b-y
#+CAPTION[Displacement in Diana from a point load (B)]: Displacement from a simulation of the Diana model of bridge 705, with a 100 kN point-load placed at $x = 51.251$ meters and $z = 16.6$ meters. The responses in this Figure match closely to the responses in Figure [[fig:comp-os-b-y]] from simulation with OpenSees.
#+ATTR_LaTeX: :placement [!p]
[[./saved-images/diana-comp/b-diana-y-translation.pdf]]

#+NAME: fig:comp-os-b-y
#+CAPTION[Displacement in OpenSees from a point load (B)]: Displacement from a simulation of the generated FEM of bridge 705 for OpenSees, with a 100 kN point-load placed at $x = 52.521$ meters and $z = 16.6$ meters. The responses in this Figure match closely to the responses in Figure [[fig:comp-diana-b-y]] from simulation with Diana.
[[./saved-images/diana-comp/b-y-translation.pdf]]

#+NAME: fig:comp-diana-b-s
#+CAPTION[Strain in Diana from a point load (B)]: Strain from a simulation of the Diana model of bridge 705, with a 100 kN point-load placed at $x = 51.251$ meters and $z = 16.6$ meters. The responses in this Figure match closely to the responses in Figure [[fig:comp-os-b-s]] from simulation with OpenSees.
[[./saved-images/diana-comp/b-diana-strain.pdf]]

#+NAME: fig:comp-os-b-s
#+CAPTION[Strain in OpenSees from a point load (B)]: Strain from a simulation of the generated FEM of bridge 705 for OpenSees, with a 100 kN point-load placed at $x = 52.521$ meters and $z = 16.6$ meters. The responses in this Figure match closely to the responses in Figure [[fig:comp-diana-b-s]] from simulation with Diana.
[[./saved-images/diana-comp/b-strain.pdf]]

#+NAME: fig:comp-diana-c-y
#+CAPTION[Displacement in Diana from a point load (C)]: Displacement from a simulation of the Diana model of bridge 705, with a 100 kN point-load placed at $x = 92.406$ meters and $z = 12.405$ meters. The responses in this Figure match closely to the responses in Figure [[fig:comp-os-c-y]] from simulation with OpenSees.
[[./saved-images/diana-comp/c-diana-y-translation.pdf]]

#+NAME: fig:comp-os-c-y
#+CAPTION[Displacement in OpenSees from a point load (C)]: Displacement from a simulation of the generated FEM of bridge 705 for OpenSees, with a 100 kN point-load placed at $x = 92.406$ meters and $z = 12.405$ meters. The responses in this Figure match closely to the responses in Figure [[fig:comp-diana-c-y]] from simulation with Diana.
[[./saved-images/diana-comp/c-y-translation.pdf]]

#+NAME: fig:comp-diana-c-s
#+CAPTION[Strain in Diana from a point load (C)]: Strain from a simulation of the Diana model of bridge 705, with a 100 kN point-load placed at $x = 92.406$ meters and $z = 12.405$ meters. The responses in this Figure match closely to the responses in Figure [[fig:comp-os-c-s]] from simulation with OpenSees.
[[./saved-images/diana-comp/c-diana-strain.pdf]]

#+NAME: fig:comp-os-c-s
#+CAPTION[Displacement in OpenSees from a point load (C)]: Strain from a simulation of the generated FEM of bridge 705 for OpenSees, with a 100 kN point-load placed at $x = 92.406$ meters and $z = 12.405$ meters. The responses in this Figure match closely to the responses in Figure [[fig:comp-diana-c-s]] from simulation with Diana.
[[./saved-images/diana-comp/c-strain.pdf]]

#+NAME: fig:comp-diana-d-y
#+CAPTION[Displacement in Diana from a point load (D)]: Displacement from a simulation of the Diana model of bridge 705, with a 100 kN point-load placed at $x = 101.765$ meters and $z = 3.974$ meters. The responses in this Figure match closely to the responses in Figure [[fig:comp-os-d-y]] from simulation with OpenSees.
[[./saved-images/diana-comp/d-diana-y-translation.pdf]]

#+NAME: fig:comp-os-d-y
#+CAPTION[Displacement in OpenSees from point load (D)]: Displacement from a simulation of the generated FEM of bridge 705 for OpenSees, with a 100 kN point-load placed at $x = 101.765$ meters and $z = 3.974$ meters. The responses in this Figure match closely to the responses in Figure [[fig:comp-diana-d-y]] from simulation with Diana.
[[./saved-images/diana-comp/d-y-translation.pdf]]

#+NAME: fig:comp-diana-d-s
#+CAPTION[Strain in Diana from a point load (D)]: Strain from a simulation of the Diana model of bridge 705, with a 100 kN point-load placed at $x = 101.765$ meters and $z = 3.974$ meters. The responses in this Figure match closely to the responses in Figure [[fig:comp-os-d-s]] from simulation with OpenSees.
[[./saved-images/diana-comp/d-diana-strain.pdf]]

#+NAME: fig:comp-os-d-s
#+CAPTION[Displacement in OpenSees from point load (D)]: Strain from a simulation of the generated FEM of bridge 705 for OpenSees, with a 100 kN point-load placed at $x = 101.765$ meters and $z = 3.974$ meters. The responses in this Figure match closely to the responses in Figure [[fig:comp-diana-d-s]] from simulation with Diana.
[[./saved-images/diana-comp/d-strain.pdf]]

#+LATEX: \clearpage
